Hiwi_Prof Nikolai Kornev/Simulation_Setup_SD7003/SD7003_Mesh_with_Blockmesh/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.000148922127301486;

boundaryField
{
    freestream
    {
        type            calculated;
        value           uniform 0.000148922127301486;
    }

    wall
    {
        type            fixedValue;
        value           uniform 0.000148922127301486;
    }
    front
    {
        type        cyclic; 
    }

    back
    {
        type        cyclic; 
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
