Hiwi_Prof Nikolai Kornev/Simulation_Setup_SD7003/SD7003_Mesh_with_Blockmesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  3.0.x                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile                                                                        
{                                                                               
    version     2.0;                                                            
    format      ascii;                                                          
    class       dictionary;                                                     
    object      blockMeshDict;                                                  
}                                                                               
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.000000; 

vertices 
( 
 /*   (-9.950848 0.250000 0.000000)  //0
    (##0.049152 0.250000 10.000000)   //1
    (#0.750000 0.250000 10.000000)   //2
    (20.000000 0.250000 10.000000)  //3
    (#-0.250000 0.250000 0.000000)   //4
    (##0.049152 0.250000 0.060007)    //5
    (##0.049152 0.250000 -0.060007)   //6
    (#0.750000 0.250000 -0.000000)   //7
    (20.000000 0.250000 -0.000000)  //8
    (##0.049152 0.250000 -10.000000)  //9
    (0.750000 0.250000 -10.000000)  //10
    (20.000000 0.250000 -10.000000)  //11
    (-9.950848 -0.250000 0.000000)  //12
    (##0.049152 -0.250000 10.000000)  //13
    (0.750000 -0.250000 10.000000)  //14
    (20.000000 -0.250000 10.000000)  //15
    (-0.250000 -0.250000 0.000000)  //16
    (##0.049152 -0.250000 0.060007)  //17
    (##0.049152 -0.250000 -0.060007)  //18
    (#0.750000 -0.250000 -0.000000)  //19
    (20.000000 -0.250000 -0.000000)  //20
    (##0.049152 -0.250000 -10.000000)  //21
    (#0.750000 -0.250000 -10.000000)  //22
    (20.000000 -0.250000 -10.000000)  //23  */

    (-9.9727512     0.1      0.000000)  //0
    (0.272488       0.1      10.000000)   //1##
    (0.750000       0.1      10.000000)   //2#
    (20.000000      0.1      10.000000)  //3
    (0              0.1      0.000000)   //4#
    (0.272488       0.1      0.056627)    //5##
  //  (0.202298       0.1     -0.029029)   //6##
    (0.269691	    0.1	     -0.028299)   //6##
    (1              0.1     -0.000000)   //7#
    (20.000000      0.1     -0.000000)  //8
    (0.202298       0.1     -10.000000)  //9##
    (0.750000       0.1     -10.000000)  //10
    (20.000000      0.1     -10.000000)  //11
    (-9.9727512    -0.1      0.000000)  //12
    (0.272488      -0.1      10.000000)  //13##
    (0.750000      -0.1      10.000000)  //14
    (20.000000     -0.1      10.000000)  //15
    (0             -0.1      0.000000)  //16
    (0.27248       -0.1      0.056627)  //17##
    (0.269691	   -0.1	     -0.028299)  //18##
    (1             -0.1      -0.000000)  //19#
    (20.00000      -0.1     -0.000000)  //20
    (0.20228       -0.1     -10.000000)  //21 ##
    (0.750000      -0.1     -10.000000)  //22#
    (20.00000      -0.1     -10.000000)  //23 
); 

blocks 
( 

/*
// No critical error  error : First cell height : 0.001 ; RANS 2D
    hex (4 5 1 0 16 17 13 12)     (60 150 20) edgeGrading (1 0.008 0.008 1 40000 40000 40000 40000 1 1 1 1) 
    hex (5 7 2 1 17 19 14 13)     (114 150 20) simpleGrading (1.5 40000 1) 
    hex (7 8 3 2 19 20 15 14)     (163 150 20) simpleGrading (70 40000 1) 
    hex (16 18 21 12 4 6 9 0)     (60 150 20) edgeGrading (1 0.008 0.008 1 40000 40000 40000 40000 1 1 1 1) 
    hex (18 19 22 21 6 7 10 9)    (114 150 20) simpleGrading (1.5 40000 1) 
    hex (19 20 23 22 7 8 11 10)   (163 150 20) simpleGrading (70 40000 1) */

/*
// No critical error  error : // First cell height : 0.0001 better aspect ratio , LES
    hex (4 5 1 0 16 17 13 12)     (60 200 40) edgeGrading (1 0.008 0.008 1 4000 4000 4000 4000 1 1 1 1) 
    hex (5 7 2 1 17 19 14 13)     (114 200 40) simpleGrading (1.5 4000 1) 
    hex (7 8 3 2 19 20 15 14)     (163 200 40) simpleGrading (70 4000 1) 
    hex (16 18 21 12 4 6 9 0)     (60 200 40) edgeGrading (1 0.008 0.008 1 4000 4000 4000 4000 1 1 1 1) 
    hex (18 19 22 21 6 7 10 9)    (114 200 40) simpleGrading (1.5 4000 1) 
    hex (19 20 23 22 7 8 11 10)   (163 200 40) simpleGrading (70 4000 1) */

// No critical error  error : // First cell height : 0.0001 better aspect ratio
 /*   hex (4 5 1 0 16 17 13 12)     (60 200 20) edgeGrading (1 0.008 0.008 1 4000 4000 4000 4000 1 1 1 1) 
    hex (5 7 2 1 17 19 14 13)     (114 200 20) simpleGrading (1.5 4000 1) 
    hex (7 8 3 2 19 20 15 14)     (163 200 20) simpleGrading (70 4000 1) 
    hex (16 18 21 12 4 6 9 0)     (60 200 20) edgeGrading (1 0.008 0.008 1 4000 4000 4000 4000 1 1 1 1) 
    hex (18 19 22 21 6 7 10 9)    (114 200 20) simpleGrading (1.5 4000 1) 
    hex (19 20 23 22 7 8 11 10)   (163 200 20) simpleGrading (70 4000 1) */


// No critical error  error : First cell height : 0.0005 RANS 3D
    hex (4 5 1 0 16 17 13 12)     (60 136 20) edgeGrading (1 0.01 0.01 1 8000 8000 8000 8000 1 1 1 1) 
    hex (5 7 2 1 17 19 14 13)     (114 136 20) simpleGrading (1.5 8000 1) 
    hex (7 8 3 2 19 20 15 14)     (163 136 20) simpleGrading (70 8000 1) 
    hex (16 18 21 12 4 6 9 0)     (60 136 20) edgeGrading (1 0.01 0.01 1 8000 8000 8000 8000 1 1 1 1) 
    hex (18 19 22 21 6 7 10 9)    (114 136 20) simpleGrading (1.5 8000 1) 
    hex (19 20 23 22 7 8 11 10)   (163 136 20) simpleGrading (70 8000 1) 

); 

edges 
( 
    spline 4 5 
        ( 
            (	0.000356	0.1 	0.001818	)
            (	0.001035	0.1	    0.003847	)
            (	0.002107	0.1	    0.005967	)
            (	0.003632	0.1	    0.008173	)
            (	0.005733	0.1	    0.010524	)
            (	0.00855	    0.1	    0.013135	)
            (	0.012287	0.1	    0.016109	)
            (	0.017231	0.1	    0.019452	)
            (	0.023697	0.1	    0.023133	)
            (	0.032071	0.1	    0.027108	)
            (	0.042422	0.1	    0.031212	)
            (	0.054348	0.1	    0.035139	)
            (	0.067449	0.1	    0.038724	)
            (	0.081455	0.1	    0.041924	)
            (	0.096085	0.1	    0.044723	)
            (	0.111143	0.1	    0.047139	)
            (	0.126534	0.1	    0.049203	)
            (	0.142194	0.1	    0.050951	)
            (	0.158071	0.1	    0.052412	)
            (	0.174119	0.1	    0.053619	)
            (	0.190298	0.1	    0.054594	)
            (	0.206581	0.1	    0.055356	)
            (	0.222952	0.1	    0.055926	)
            (	0.2394	    0.1	    0.056317	)
            (	0.255915	0.1	    0.056546	)
    //        (	0.272488	0.1	    0.056627	)
 
        ) 
    spline 5 7 
        ( 
            (	0.289109	0.1	    0.056569	)
            (	0.305769	0.1	    0.056386	)
            (	0.322459	0.1	    0.056085	)
            (	0.339178	0.1	    0.055672	)
            (	0.355928	0.1 	0.055157	)
            (	0.372709	0.1	    0.054546	)
            (	0.389515	0.1	    0.053849	)
            (	0.406337	0.1	    0.05307	    )
            (	0.423167	0.1	    0.052215	)
            (	0.44001	    0.1	    0.051287	)
            (	0.456872	0.1	    0.050289	)
            (	0.473757	0.1	    0.049228	)
            (	0.490662	0.1	    0.04811	    )
            (	0.507573	0.1	    0.046941	)
            (	0.524485	0.1 	0.045722	)
            (	0.541396	0.1 	0.044454	)
            (	0.558313	0.1 	0.043139	)
            (	0.575241	0.1	    0.041779	)
            (	0.592182	0.1	    0.040379	)
            (	0.609134	0.1	    0.038941	)
            (	0.626094	0.1	    0.037468	)
            (	0.643061	0.1	    0.035965	)
            (	0.660032	0.1	    0.034432	)
            (	0.677008	0.1	    0.032874	)
            (	0.693995	0.1	    0.03129	    )
            (	0.710998	0.1	    0.029684	)
            (	0.728017	0.1	    0.028061	)
            (	0.745042	0.1	    0.026425	)
            (	0.762059	0.1	    0.024777	)
            (	0.779066	0.1	    0.023117	)
            (	0.796076	0.1	    0.021441	)
            (	0.813101	0.1	    0.019751	)
            (	0.830136	0.1	    0.018052	)
            (	0.847165	0.1	    0.016346	)
            (	0.86418	    0.1	    0.014631	)
            (	0.881188	0.1	    0.012904	)
            (	0.89819	    0.1	    0.011165	)
            (	0.915159	0.1	    0.009415	)
            (	0.932014	0.1	    0.007644	)
            (	0.948638	0.1	    0.005838	)
            (	0.964953	0.1	    0.003973	)
            (	0.980327	0.1	    0.00215	    )
            (	0.993257	0.1	    0.000678	)
          //  (	1	        0.1	    0	        )

        ) 
    spline 4 6 
        ( 
            (	0.000081	0.1 	-0.000074	)
            (	0.000243	0.1	    -0.001832	)
            (	0.000908	0.1	    -0.003489	)
            (	0.002092	0.1	    -0.005124	)
            (	0.003853	0.1	    -0.006824	)
            (	0.006247	0.1	    -0.008652	)
            (	0.009385	0.1	    -0.010589	)
            (	0.01338	    0.1	    -0.012547	)
            (	0.018328	0.1	    -0.01452	)
            (	0.024705	0.1	    -0.016584	)
            (	0.033334	0.1	    -0.018775	)
            (	0.04457	    0.1	    -0.020922	)
            (	0.057629	0.1	    -0.022807	)
            (	0.072085	0.1	    -0.024406	)
            (	0.08751	    0.1	    -0.02572	)
            (	0.103389	0.1	    -0.026754	)
            (	0.119513	0.1	    -0.02755	)
            (	0.135849	0.1	    -0.028146	)
            (	0.152337	0.1	    -0.028572	)
            (	0.168921	0.1	    -0.028849	)
            (	0.185575	0.1	    -0.028996	)
            (	0.202298	0.1	    -0.029029	)
            (	0.219084	0.1	    -0.028965	)
            (	0.235918	0.1	    -0.028815	)
            (	0.25279 	0.1	    -0.02859	)
 //           (	0.269691	0.1	    -0.028299	)

        ) 
    spline 6 7 
        ( 
            (	0.286617	0.1 	-0.027948	)
            (	0.303566	0.1	    -0.027545	)
            (	0.320534	0.1	    -0.027095	)
            (	0.337521	0.1	    -0.026602	)
            (	0.354523	0.1	    -0.026072	)
            (	0.371536	0.1	    -0.025507	)
            (	0.388555	0.1	    -0.024911	)
            (	0.405579	0.1	    -0.024285	)
            (	0.422605	0.1	    -0.023631	)
            (	0.439635	0.1	    -0.02295	)
            (	0.456669	0.1	    -0.022242	)
            (	0.473708	0.1	    -0.02151	)
            (	0.490752	0.1	    -0.020754	)
            (	0.507801	0.1	    -0.019977	)
            (	0.524853	0.1	    -0.019179	)
            (	0.541906	0.1	    -0.018361	)
            (	0.558957	0.1	    -0.017524	)
            (	0.576005	0.1	    -0.016666	)
            (	0.593052	0.1	    -0.01579	)
            (	0.610099	0.1	    -0.014894	)
            (	0.627152	0.1	    -0.013979	)
            (	0.644215	0.1	    -0.013046	)
            (	0.661291	0.1	    -0.0121	)
            (	0.678376	0.1	    -0.011143	)
            (	0.695463	0.1	    -0.010181	)
            (	0.712545	0.1	    -0.009221	)
            (	0.729616	0.1	    -0.008271	)
            (	0.746672	0.1	    -0.007337	)
            (	0.763709	0.1	    -0.006424	)
            (	0.780724	0.1	    -0.005537	)
            (	0.797717	0.1	    -0.004682	)
            (	0.814692	0.1	    -0.003864	)
            (	0.831653	0.1	    -0.003088	)
            (	0.8486	    0.1	    -0.002357	)
            (	0.865519	0.1	    -0.001679	)
            (	0.882393	0.1	    -0.001061	)
            (	0.899216	0.1	    -0.000518	)
            (	0.915981	0.1	    -0.000062	)
            (	0.932643	0.1	    0.000291	)
            (	0.949118	0.1	    0.000516	)
            (	0.965237	0.1	    0.000588	)
            (	0.98035 	0.1 	0.000488	)
            (	0.993228	0.1	    0.000219	)
          //  (	1	        0.1	    0	        )

        ) 
    spline 16 17 
        ( 
            (	0.000356	-0.1	0.001818	)
            (	0.001035	-0.1	0.003847	)
            (	0.002107	-0.1	0.005967	)
            (	0.003632	-0.1	0.008173	)
            (	0.005733	-0.1	0.010524	)
            (	0.00855	    -0.1	0.013135	)
            (	0.012287	-0.1	0.016109	)
            (	0.017231	-0.1	0.019452	)
            (	0.023697	-0.1	0.023133	)
            (	0.032071	-0.1	0.027108	)
            (	0.042422	-0.1	0.031212	)
            (	0.054348	-0.1	0.035139	)
            (	0.067449	-0.1	0.038724	)
            (	0.081455	-0.1	0.041924	)
            (	0.096085	-0.1	0.044723	)
            (	0.111143	-0.1	0.047139	)
            (	0.126534	-0.1	0.049203	)
            (	0.142194	-0.1	0.050951	)
            (	0.158071	-0.1	0.052412	)
            (	0.174119	-0.1	0.053619	)
            (	0.190298	-0.1	0.054594	)
            (	0.206581	-0.1	0.055356	)
            (	0.222952	-0.1	0.055926	)
            (	0.2394	    -0.1	0.056317	)
            (	0.255915	-0.1	0.056546	)
        //    (	0.272488	-0.1	0.056627	)

        ) 
    spline 17 19 
        ( 
            (	0.289109	-0.1	0.056569	)
            (	0.305769	-0.1	0.056386	)
            (	0.322459	-0.1	0.056085	)
            (	0.339178	-0.1	0.055672	)
            (	0.355928	-0.1	0.055157	)
            (	0.372709	-0.1	0.054546	)
            (	0.389515	-0.1	0.053849	)
            (	0.406337	-0.1	0.05307	    )
            (	0.423167	-0.1	0.052215	)
            (	0.44001	    -0.1	0.051287	)
            (	0.456872	-0.1	0.050289	)
            (	0.473757	-0.1	0.049228	)
            (	0.490662	-0.1	0.04811	    )
            (	0.507573	-0.1	0.046941	)
            (	0.524485	-0.1	0.045722	)
            (	0.541396	-0.1	0.044454	)
            (	0.558313	-0.1	0.043139	)
            (	0.575241	-0.1	0.041779	)
            (	0.592182	-0.1	0.040379	)
            (	0.609134	-0.1	0.038941	)
            (	0.626094	-0.1	0.037468	)
            (	0.643061	-0.1	0.035965	)
            (	0.660032	-0.1	0.034432	)
            (	0.677008	-0.1	0.032874	)
            (	0.693995	-0.1	0.03129	    )
            (	0.710998	-0.1	0.029684	)
            (	0.728017	-0.1	0.028061	)
            (	0.745042	-0.1	0.026425	)
            (	0.762059	-0.1	0.024777	)
            (	0.779066	-0.1	0.023117	)
            (	0.796076	-0.1	0.021441	)
            (	0.813101	-0.1	0.019751	)
            (	0.830136	-0.1	0.018052	)
            (	0.847165	-0.1	0.016346	)
            (	0.86418	    -0.1	0.014631    )
            (	0.881188	-0.1	0.012904	)
            (	0.89819	    -0.1	0.011165	)
            (	0.915159	-0.1	0.009415	)
            (	0.932014	-0.1	0.007644	)
            (	0.948638	-0.1	0.005838	)
            (	0.964953	-0.1	0.003973	)
            (	0.980327	-0.1	0.00215	    )
            (	0.993257	-0.1	0.000678	)
       //     (	1	        -0.1	0	        )

        ) 
    spline 16 18 
        ( 
            (	0.000081	-0.1	-0.000074	)
            (	0.000243	-0.1	-0.001832	)
            (	0.000908	-0.1	-0.003489	)
            (	0.002092	-0.1	-0.005124	)
            (	0.003853	-0.1	-0.006824	)
            (	0.006247	-0.1	-0.008652	)
            (	0.009385	-0.1	-0.010589	)
            (	0.01338	    -0.1	-0.012547	)
            (	0.018328	-0.1	-0.01452	)
            (	0.024705	-0.1	-0.016584	)
            (	0.033334	-0.1	-0.018775	)
            (	0.04457	    -0.1	-0.020922	)
            (	0.057629	-0.1	-0.022807	)
            (	0.072085	-0.1	-0.024406	)
            (	0.08751	    -0.1	-0.02572	)
            (	0.103389	-0.1	-0.026754	)
            (	0.119513	-0.1	-0.02755	)
            (	0.135849	-0.1	-0.028146	)
            (	0.152337	-0.1	-0.028572	)
            (	0.168921	-0.1	-0.028849	)
            (	0.185575	-0.1	-0.028996	)
            (	0.202298	-0.1	-0.029029	)
            (	0.219084	-0.1	-0.028965	)
            (	0.235918	-0.1	-0.028815	)
            (	0.25279	    -0.1	-0.02859	)
    //        (	0.269691	-0.1	-0.028299	)

        ) 
    spline 18 19 
        ( 
            
            (	0.286617	-0.1	-0.027948	)
            (	0.303566	-0.1	-0.027545	)
            (	0.320534	-0.1	-0.027095	)
            (	0.337521	-0.1	-0.026602	)
            (	0.354523	-0.1	-0.026072	)
            (	0.371536	-0.1	-0.025507	)
            (	0.388555	-0.1	-0.024911	)
            (	0.405579	-0.1	-0.024285	)
            (	0.422605	-0.1	-0.023631	)
            (	0.439635	-0.1	-0.02295	)
            (	0.456669	-0.1	-0.022242	)
            (	0.473708	-0.1	-0.02151	)
            (	0.490752	-0.1	-0.020754	)
            (	0.507801	-0.1	-0.019977	)
            (	0.524853	-0.1	-0.019179	)
            (	0.541906	-0.1	-0.018361	)
            (	0.558957	-0.1	-0.017524	)
            (	0.576005	-0.1	-0.016666	)
            (	0.593052	-0.1	-0.01579	)
            (	0.610099	-0.1	-0.014894	)
            (	0.627152	-0.1	-0.013979	)
            (	0.644215	-0.1	-0.013046	)
            (	0.661291	-0.1	-0.0121	    )
            (	0.678376	-0.1	-0.011143	)
            (	0.695463	-0.1	-0.010181	)
            (	0.712545	-0.1	-0.009221	)
            (	0.729616	-0.1	-0.008271	)
            (	0.746672	-0.1	-0.007337	)
            (	0.763709	-0.1	-0.006424	)
            (	0.780724	-0.1	-0.005537	)
            (	0.797717	-0.1	-0.004682	)
            (	0.814692	-0.1	-0.003864	)
            (	0.831653	-0.1	-0.003088	)
            (	0.8486	    -0.1	-0.002357	)
            (	0.865519	-0.1	-0.001679	)
            (	0.882393	-0.1	-0.001061	)
            (	0.899216	-0.1	-0.000518	)
            (	0.915981	-0.1	-0.000062	)
            (	0.932643	-0.1	0.000291	)
            (	0.949118	-0.1	0.000516	)
            (	0.965237	-0.1	0.000588	)
            (	0.98035	    -0.1	0.000488	)
            (	0.993228	-0.1	0.000219	)
      //      (	1	        -0.1	0	        )

        ) 
    arc 0 1 (-7.043819012 0.1 7.07106812) 
    arc 0 9 (-7.043819012 0.1 -7.07106812) 
    arc 12 13 (-7.043819012 -0.1 7.07106812) 
    arc 12 21 (-7.043819012 -0.1 -7.07106812) 
); 

boundary 
( 
    inlet 
    { 
        type patch;
        inGroups (freestream); 
        faces 
        ( 
            (1 0 12 13) 
            (0 9 21 12)
            (3 2 14 15) 
            (2 1 13 14) 
            (9 10 22 21) 
            (10 11 23 22)
        ); 
    } 

    outlet 
    { 
        type patch;
        inGroups (freestream); 
        faces 
        ( 
            (11 8 20 23) 
            (8 3 15 20) 
        ); 
    } 

  /*  topAndBottom 
    { 
        type patch; 
        faces 
        ( 
            (3 2 14 15) 
            (2 1 13 14) 
            (9 10 22 21) 
            (10 11 23 22) 
        ); 
    } */

    aerofoil 
    { 
        type wall; 
        faces 
        ( 
            (5 4 16 17)
            (4 6 18 16) 
            (7 5 17 19) 
            (6 7 19 18) 
        ); 
    } 

    back
    {
        //type empty;
        type cyclic;
        neighbourPatch front;
        faces
        (
            (3 2 7 8)
            (2 1 5 7)
            (1 0 4 5)
            (0 9 6 4)
            (9 10 7 6)
            (10 11 8 7)
         );
        
     }

    front
        {
           //type empty;
            type cyclic;
            neighbourPatch back;
            faces
            (
                (15 14 19 20)
                (13 14 17 19)
                (13 12 16 17)
                (12 21 18 16)
                (21 22 19 18)
                (22 23 20 19) 
             );
            
         }
); 
 
mergePatchPairs 
( 
); 
 
// ************************************************************************* // 
