Hiwi_Prof Nikolai Kornev/Simulation_Setup_SD7003/SD7003_Mesh_with_Blockmesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam; //pisoFoam //simpleFoam //pimpleFoam

startFrom       latestTime;

startTime       0;

stopAt          endTime; //endTime; //writeNow

endTime         15;

deltaT          0.0005;

writeControl    adjustableRunTime; //adjustableRunTime

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision   10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc residuals
   // #includeFunc CourantNo
    #includeFunc forceCoeffsIncompressible
    #includeFunc forcesIncompressible
    #includeFunc totalPressureIncompressible
    #includeFunc totalPressureIncompressible.cfg
    #includeFunc wallShearStress
    #includeFunc yPlus
    #includeFunc staticPressureIncompressible
    #includeFunc staticPressureIncompressible.cfg  
}

// ************************************************************************* //
