Hiwi_Prof Nikolai Kornev/Simulation_Setup_SD7003/SD7003_Mesh_with_Blockmesh/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible; i.e.,
    pressure is kinematic and has units of m^2/s^2.

\*---------------------------------------------------------------------------*/
#include    "$FOAM_CASE/0/U"

#includeEtc "caseDicts/postProcessing/forces/forceCoeffsIncompressible.cfg"

patches     (aerofoil); // Names of patches on which to calculate forces
log true;
magUInf     0.888;      // Far field velocity magnitude; e.g., 20 m/s
lRef        1;         // Reference length scale for moment calculations;
                            // e.g., 1 m
Aref        0.2;         // Reference area; e.g., 1 m^2

CofR      (0.2 0 0);         // Centre of rotation; e.g., (0 0 0)

//liftDir   (0.258 0 0.965);      // Direction of lift force; e.g., (0 0 1) ~ (SinAoA, 0, CosAoA)
//dragDir   (0.965 0 0.258);      // Direction of drag force; e.g., (1 0 0) ~ (CosAoA, 0, SinAoA)
pitchAxis (0 1 0);    // Pitch axis; e.g., (0 1 0)

//outputControl   timeStep;
//outputInterval  100;
//executeControl  timeStep;
//executeInterval 1;
writeControl    timeStep;
writeInterval   100;
// ************************************************************************* //
