Hiwi_Prof Nikolai Kornev/Simulation_Setup_SD7003/SD7003_Mesh_with_Blockmesh/system/forcesIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is incompressible; i.e., pressure is kinematic and has
    units of m^2/s^2.

\*---------------------------------------------------------------------------*/
#include    "$FOAM_CASE/0/U"
#includeEtc "caseDicts/postProcessing/forces/forcesIncompressible.cfg"

patches     (aerofoil); // Names of patches on which to calculate forces

rhoInf      1.2754;       // Far field density; e.g., 1.225 kg/m^3 for air

CofR        (0.2 0 0);         // Centre of rotation; e.g., (0 0 0)

pitchAxis   (0 1 0);    // Pitch axis; e.g., (0 1 0)

// ************************************************************************* //
