Hiwi_Prof Nikolai Kornev/Simulation_Setup_SD7003/SD7003_Mesh_with_Blockmesh/system/staticPressureIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the static pressure field in units of kg/m/s^2 (Pa) from the
    kinematic pressure by scaling by a specified density.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/pressure/staticPressureIncompressible.cfg"

rhoInf  1.2754; // Density with which to scale the kinematic pressure

// ************************************************************************* //
