Hiwi_Prof Nikolai Kornev/Simulation_Setup_SD7003/SD7003_Mesh_with_Blockmesh/system/staticPressureIncompressible.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
#include    "$FOAM_CASE/0/U"
#includeEtc "caseDicts/postProcessing/pressure/pressure.cfg"

calcTotal     no;
calcCoeff     yes;

rho         rhoInf;
rhoInf      1.2754;
pRef        0;
pInf        0;
UInf        $Uinlet;

// ************************************************************************* //
