Hiwi_Prof Nikolai Kornev/Simulation_Setup_SD7003/SD7003_Mesh_with_Blockmesh/system/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the shear stress at wall patches, outputting the data as a
    volVectorField.

\*---------------------------------------------------------------------------*/

type            wallShearStress;
libs            ("libfieldFunctionObjects.so");

executeControl  timeStep;
executeInterval 1;
writeControl    writeTime;
writeInterval   100;
// ************************************************************************* //
